Autodesk.Revit.DB.Macros.DocumentMacroOptions
The document macro options.
Since:
2014
Since:
2014

Autodesk.Revit.DB.Macros.DocumentMacroOptions.DisableMacros
The option to disable macros in the document.

Autodesk.Revit.DB.Macros.DocumentMacroOptions.EnableMacros
The option to enable macros in the document.